app/views/inventories/edit.html.erb


<% @inventory.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."inventory_id" = ?  [["inventory_id", 1]]