app/views/inventories/index.html.erb

					<ul>
            <% inventory.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."inventory_id" = ?  [["inventory_id", 1]]