app/views/users/index.html.erb

  <ol>
    <% @user.inventory.products.each do |product| %>
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."inventory_id" = ?  [["inventory_id", 1]]