app/views/users/show.html.erb

    <tbody>
      <% @user.inventory.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."inventory_id" = ?  [["inventory_id", 1]]