app/views/carts/show.html.erb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
    <tbody>
      <% @user.cart.cart_products.each do |cart_product| %>