app/views/carts/show.html.erb

    <tbody>
      <% @user.products.each do |product| %>
---
SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ?  [["cart_id", 1]]
SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" INNER JOIN "carts" ON "cart_products"."cart_id" = "carts"."id" WHERE "carts"."user_id" = ?  [["user_id", 1]]