app/controllers/carts_controller.rb

  def show
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_cart
    @cart = Cart.find(session[:user_id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]