app/controllers/cart_products_controller.rb

  def show
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    # byebug
    @user = User.find(session[:user_id])
    product = Product.find(params[:product_id])
    # byebug
    @cart_product = @user.cart.add_product(product.id)
    # byebug
    if @cart_product.valid?
      @cart_product.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ? AND "cart_products"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cart_products" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["product_id", 2], ["quantity", 1], ["created_at", "2018-08-23 22:36:55.479870"], ["updated_at", "2018-08-23 22:36:55.479870"]]
UPDATE "cart_products" SET "quantity" = ?, "updated_at" = ? WHERE "cart_products"."id" = ?  [["quantity", 1], ["updated_at", "2018-08-23 20:05:22.417224"], ["id", 4]]

  def destroy
    # @cart_product = CartProduct.find(params[:id])
    @cart_product.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
DELETE FROM "cart_products" WHERE "cart_products"."id" = ?  [["id", 1]]

  def set_cart_product
    # byebug
    @cart_product = CartProduct.find(params[:id])
---
SELECT  "cart_products".* FROM "cart_products" WHERE "cart_products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]