app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
---
  def index
    @inventories = Inventory.all

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_inventory
    @inventory = Inventory.find(params[:id])