app/controllers/products_controller.rb

UPDATE "products" SET "seller_id" = ?, "inventory_id" = ?, "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["seller_id", 6], ["inventory_id", 5], ["image_url", "http://cdn.gadgetreview.com/wp-content/uploads/2014/08/lcd-tv-reviews.jpg"], ["updated_at", "2018-08-24 14:37:09.689502"], ["id", 8]]
---
  def update
    if @product.update_attributes(product_params)

INSERT INTO "products" ("name", "price", "description", "seller_id", "inventory_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # byebug
    @product = Product.new(product_params)

    if @product.save!

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
---
  def destroy

    current_product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def current_product
    @product = Product.find(params[:id])