app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "email1@1.com"], ["LIMIT", 1]]
---
  def create
    # find the user with that username
    user = User.find_by(email: params[:email])