app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # byebug

      # byebug
    if @user.valid?
      @user.save
      # byebug
      session[:user_id] = @user.id
      #create cart for user
      @user.cart = Cart.create(user: current_user)

      #if seller, create inventory for user
      if @user.is_seller
        @user.inventory = Inventory.create(seller: current_user)
---
INSERT INTO "users" ("username", "password_digest", "email", "first_name", "last_name", "credit_card_number", "is_seller", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 4], ["created_at", "2018-08-23 22:48:18.588463"], ["updated_at", "2018-08-23 22:48:18.588463"]]
INSERT INTO "inventories" ("seller_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["seller_id", 4], ["created_at", "2018-08-23 22:48:18.640612"], ["updated_at", "2018-08-23 22:48:18.640612"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$oQSep8iRawdMG0mQLCIYZOwSGTX4W7xL6LCoO3.tpCYbwcpPMAvT2"], ["first_name", "Benny"], ["updated_at", "2018-08-23 22:50:54.464592"], ["id", 4]]