app/models/cart.rb

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ?  [["cart_id", 6]]
---
  def total_price
    sum = 0
    self.cart_products.each do |cart_product|

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = ?  [["cart_id", 6]]
---
  def hsh_of_products_in_seller_inventory
    selected = Hash.new(0)
    self.cart_products.each do |cart_product|

SELECT "cart_products".* FROM "cart_products"
SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = ?  [["cart_id", 6]]
---
  def not_in_stock
    to_be_sold = hsh_of_products_in_seller_inventory
    returned = self.products.reject { |product| to_be_sold.keys.include?(product) }

DELETE FROM "cart_products" WHERE "cart_products"."id" = ?  [["id", 53]]
SELECT "cart_products".* FROM "cart_products"
---
  def clean_cart
    CartProduct.all.select { |cart_product| cart_product.cart_id == self.id }.map { |cp| cp.destroy }