app/models/inventory.rb

SELECT  "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "chocolate bar"], ["LIMIT", 1]]
---
  def find_product(product_name)
    product = Product.find_by(name: product_name)