app/models/product.rb

  def total_price(cart)
    selected_product = cart.products.select { |product| product.id == self.id }
---
SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."product_id" = ?  [["product_id", 1]]